Revit 2027 API
PanelScheduleData.IsSymmetric Method
 Check if this panel schedule is symmetric
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsSymmetric()
Public Function IsSymmetric As Boolean
public:
bool IsSymmetric()
member IsSymmetric : unit -> bool
Return Value
Boolean
 True if this panel schedule is symmetric, false otherwise.
See Also
Reference
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace